## Practica 07: Análisis de Datos caso Salario de Especialistas en Inteligencia Artificial y Machine Learning

Practica 06: Análisis de Datos caso Salario de Especialistas en Inteligencia Artificial y Machine Learning

Asignatura: Extracción de Conocimientos de Base de Datos


PE: Ingeniería en Desarrollo  y Gestión de Software - 9°B

In [14]:
# Carga de paquetes y librerías a utilizar
# Básicos (Standard)
import numpy as np # Sirve para poder realizar procesamientos básicos numéricos en datos cuantitativos
import pandas as pd # Sirve para realizar los procesos ETL en un conjunto de datos
import time # Sirve para la manipulación de datos en diferentes formatos de tiempo
import requests # Sirve para realizar peticiones HTTP a APIs
import json # Sirve para manipular datos en formato JSON

!pip install pymysql
# Base de Datos
import sqlalchemy # Sirve para crear conexiones más robustas a bases de datos
from sqlalchemy import create_engine, text
import pymysql # Sirve para conectar con MySQL


# Graficadores (Plots)
import matplotlib.pyplot as plt
import plotly.express as px
import seaborn as sns

Requirement already satisfied: pymysql in c:\users\zamyc\anaconda3\lib\site-packages (1.1.1)

# Carga de Datos

# EJERCICIO 1: IMPORTACIÓN DE DATOS SQL (MySQL)

In [15]:


# Conectar a MySQL
engine = create_engine('mysql+pymysql://root:1234@localhost:3309/employees_ai_db', echo=True)

In [16]:
# Importar datos desde la base de datos SQL
query = """
SELECT * FROM employees_ai
"""

df = pd.read_sql(query, engine)
df.head()

2025-06-26 21:12:46,132 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2025-06-26 21:12:46,132 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 21:12:46,132 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2025-06-26 21:12:46,132 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 21:12:46,132 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2025-06-26 21:12:46,132 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 21:12:46,148 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2025-06-26 21:12:46,148 INFO sqlalchemy.engine.Engine [generated in 0.00125s] {'table_schema': 'employees_ai_db', 'table_name': '\nSELECT * FROM employees_ai\n'}
2025-06-26 21:12:46,148 INFO sqlalchemy.engine.Engine
SELECT * FROM employees_ai

2025-06-26 21:12:46,148 INFO sqlalchemy.engine.Engine [raw sql] {}

,employee_id,name,position,salary,experience_years,department
0,1,Ana García,Data Scientist,95000.0,3.0,Research
1,2,Carlos López,ML Engineer,105000.0,5.0,Engineering
2,3,María Rodríguez,AI Researcher,120000.0,8.0,Research
3,4,Juan Pérez,Data Analyst,75000.0,2.0,Analytics
4,5,Laura Martín,ML Engineer,100000.0,4.0,Engineering

In [17]:
### Limpiar de Datos
# Verificar información del dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       12 non-null     int64
 1   name              11 non-null     object
 2   position          11 non-null     object
 3   salary            11 non-null     float64
 4   experience_years  11 non-null     float64
 5   department        11 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 708.0+ bytes

In [18]:
# Verificar valores nulos
df.isnull().sum()

employee_id         0
name                1
position            1
salary              1
experience_years    1
department          1
dtype: int64

In [12]:
# Verificar duplicados
df.duplicated().sum()

0

In [19]:
# Eliminar duplicados
df_duplicados_eliminados = df.drop_duplicates()
df_duplicados_eliminados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       12 non-null     int64
 1   name              11 non-null     object
 2   position          11 non-null     object
 3   salary            11 non-null     float64
 4   experience_years  11 non-null     float64
 5   department        11 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 708.0+ bytes

In [20]:
# Eliminar filas vacías o nulas
df_vacios_eliminados = df_duplicados_eliminados.dropna()
df_vacios_eliminados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 0 to 11
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       11 non-null     int64
 1   name              11 non-null     object
 2   position          11 non-null     object
 3   salary            11 non-null     float64
 4   experience_years  11 non-null     float64
 5   department        11 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 616.0+ bytes

# Transformación de Datos

In [21]:
# Crear nuevas columnas transformadas
df_vacios_eliminados = df[df['salary'].notna()].copy()

# Crear nuevas columnas transformadas sin advertencias
df_vacios_eliminados['salary_category'] = pd.cut(
    df_vacios_eliminados['salary'], 
    bins=[0, 80000, 100000, float('inf')], 
    labels=['Bajo', 'Medio', 'Alto']
)

df_vacios_eliminados['salary_per_experience'] = (
    df_vacios_eliminados['salary'] / df_vacios_eliminados['experience_years']
)

# Mostrar las primeras filas
df_vacios_eliminados.head()

,employee_id,name,position,salary,experience_years,department,salary_category,salary_per_experience
0,1,Ana García,Data Scientist,95000.0,3.0,Research,Medio,31666.666667
1,2,Carlos López,ML Engineer,105000.0,5.0,Engineering,Alto,21000.000000
2,3,María Rodríguez,AI Researcher,120000.0,8.0,Research,Alto,15000.000000
3,4,Juan Pérez,Data Analyst,75000.0,2.0,Analytics,Bajo,37500.000000
4,5,Laura Martín,ML Engineer,100000.0,4.0,Engineering,Medio,25000.000000

# Exportar Datos a una Tabla Temporal de SQL (MySQL)

In [22]:
# Exportar a tabla temporal en MySQL
table_name = 'employees_processed_temp'
df_vacios_eliminados.to_sql(table_name, engine, if_exists='replace', index=False)

2025-06-26 21:13:08,391 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-26 21:13:08,397 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2025-06-26 21:13:08,399 INFO sqlalchemy.engine.Engine [cached since 22.25s ago] {'table_schema': 'employees_ai_db', 'table_name': 'employees_processed_temp'}
2025-06-26 21:13:08,405 INFO sqlalchemy.engine.Engine
CREATE TABLE employees_processed_temp (
	employee_id BIGINT,
	name TEXT,
	position TEXT,
	salary FLOAT(53),
	experience_years FLOAT(53),
	department TEXT,
	salary_category TEXT,
	salary_per_experience FLOAT(53)
)


2025-06-26 21:13:08,406 INFO sqlalchemy.engine.Engine [no key 0.00147s] {}
2025-06-26 21:13:08,438 INFO sqlalchemy.engine.Engine INSERT INTO employees_processed_temp (employee_id, name, position, salary, experience_years, department, salary_category, salary_per_experience) VALUES (%(employee_id)s, %(name)s, %(position)s, %(salary)s, %(experience_years)s, %(department)s, %(salary_category)s, %(salary_per_experience)s)
2025-06-26 21:13:08,439 INFO sqlalchemy.engine.Engine [generated in 0.00134s] ({'employee_id': 1, 'name': 'Ana García', 'position': 'Data Scientist', 'salary': 95000.0, 'experience_years': 3.0, 'department': 'Research', 'salary_category': 'Medio', 'salary_per_experience': 31666.666666666668}, {'employee_id': 2, 'name': 'Carlos López', 'position': 'ML Engineer', 'salary': 105000.0, 'experience_years': 5.0, 'department': 'Engineering', 'salary_category': 'Alto', 'salary_per_experience': 21000.0}, {'employee_id': 3, 'name': 'María Rodríguez', 'position': 'AI Researcher', 'salary': 120000.0, 'experience_years': 8.0, 'department': 'Research', 'salary_category': 'Alto', 'salary_per_experience': 15000.0}, {'employee_id': 4, 'name': 'Juan Pérez', 'position': 'Data Analyst', 'salary': 75000.0, 'experience_years': 2.0, 'department': 'Analytics', 'salary_category': 'Bajo', 'salary_per_experience': 37500.0}, {'employee_id': 5, 'name': 'Laura Martín', 'position': 'ML Engineer', 'salary': 100000.0, 'experience_years': 4.0, 'department': 'Engineering', 'salary_category': 'Medio', 'salary_per_experience': 25000.0}, {'employee_id': 6, 'name': 'Diego Silva', 'position': 'Data Scientist', 'salary': 98000.0, 'experience_years': 3.0, 'department': 'Research', 'salary_category': 'Medio', 'salary_per_experience': 32666.666666666668}, {'employee_id': 7, 'name': 'Carmen Ruiz', 'position': 'AI Engineer', 'salary': 110000.0, 'experience_years': 6.0, 'department': 'Engineering', 'salary_category': 'Alto', 'salary_per_experience': 18333.333333333332}, {'employee_id': 8, 'name': 'Roberto Torres', 'position': 'Data Analyst', 'salary': 72000.0, 'experience_years': 1.0, 'department': 'Analytics', 'salary_category': 'Bajo', 'salary_per_experience': 72000.0}  ... displaying 10 of 11 total bound parameter sets ...  {'employee_id': 10, 'name': 'Miguel Santos', 'position': 'AI Specialist', 'salary': 90000.0, 'experience_years': 2.0, 'department': 'Engineering', 'salary_category': 'Medio', 'salary_per_experience': 45000.0}, {'employee_id': 12, 'name': 'Miguel Santos', 'position': 'AI Specialist', 'salary': 90000.0, 'experience_years': 2.0, 'department': 'Engineering', 'salary_category': 'Medio', 'salary_per_experience': 45000.0})
2025-06-26 21:13:08,439 INFO sqlalchemy.engine.Engine COMMIT

11

In [23]:
# Verificar que la tabla temporal se creó correctamente
verification_query = f"SELECT COUNT(*) as total_records FROM {table_name}"
result = pd.read_sql(verification_query, engine)

2025-06-26 21:13:12,659 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2025-06-26 21:13:12,660 INFO sqlalchemy.engine.Engine [cached since 26.51s ago] {'table_schema': 'employees_ai_db', 'table_name': 'SELECT COUNT(*) as total_records FROM employees_processed_temp'}
2025-06-26 21:13:12,664 INFO sqlalchemy.engine.Engine SELECT COUNT(*) as total_records FROM employees_processed_temp
2025-06-26 21:13:12,665 INFO sqlalchemy.engine.Engine [raw sql] {}

In [24]:
# Verificar exportación
verification_query = f"SELECT COUNT(*) as total FROM {table_name}"
result = pd.read_sql(verification_query, engine)
result

2025-06-26 21:13:15,354 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2025-06-26 21:13:15,354 INFO sqlalchemy.engine.Engine [cached since 29.21s ago] {'table_schema': 'employees_ai_db', 'table_name': 'SELECT COUNT(*) as total FROM employees_processed_temp'}
2025-06-26 21:13:15,366 INFO sqlalchemy.engine.Engine SELECT COUNT(*) as total FROM employees_processed_temp
2025-06-26 21:13:15,367 INFO sqlalchemy.engine.Engine [raw sql] {}

   total
0     11

# Ejercicio 2

# Importar datos de un API - get

In [25]:
# Realizar petición GET a una API
api_url = "https://jsonplaceholder.typicode.com/users"
response = requests.get(api_url)

In [52]:
api_data = response.json()
df_api = pd.json_normalize(api_data)

df_api.head()

,id,name,username,email,phone,website,address.street,address.suite,address.city,address.zipcode,address.geo.lat,address.geo.lng,company.name,company.catchPhrase,company.bs
0,1,Leanne Graham,Bret,Sincere@april.biz,1-770-736-8031 x56442,hildegard.org,Kulas Light,Apt. 556,Gwenborough,92998-3874,-37.3159,81.1496,Romaguera-Crona,Multi-layered client-server neural-net,harness real-time e-markets
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,010-692-6593 x09125,anastasia.net,Victor Plains,Suite 879,Wisokyburgh,90566-7771,-43.9509,-34.4618,Deckow-Crist,Proactive didactic contingency,synergize scalable supply-chains
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,1-463-123-4447,ramiro.info,Douglas Extension,Suite 847,McKenziehaven,59590-4157,-68.6102,-47.0653,Romaguera-Jacobson,Face to face bifurcated interface,e-enable strategic applications
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,493-170-9623 x156,kale.biz,Hoeger Mall,Apt. 692,South Elvis,53919-4257,29.4572,-164.2990,Robel-Corkery,Multi-tiered zero tolerance productivity,transition cutting-edge web services
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,(254)954-1289,demarco.info,Skiles Walks,Suite 351,Roscoeview,33263,-31.8129,62.5342,Keebler LLC,User-centric fault-tolerant solution,revolutionize end-to-end systems

# Limpiar Datos

In [53]:
# Verificar información del dataset de API
df_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   10 non-null     int64
 1   name                 10 non-null     object
 2   username             10 non-null     object
 3   email                10 non-null     object
 4   phone                10 non-null     object
 5   website              10 non-null     object
 6   address.street       10 non-null     object
 7   address.suite        10 non-null     object
 8   address.city         10 non-null     object
 9   address.zipcode      10 non-null     object
 10  address.geo.lat      10 non-null     object
 11  address.geo.lng      10 non-null     object
 12  company.name         10 non-null     object
 13  company.catchPhrase  10 non-null     object
 14  company.bs           10 non-null     object
dtypes: int64(1), object(14)
memory usage: 1.3+ KB

In [54]:
# Verificar valores nulos
df_api.isnull().sum()

id                     0
name                   0
username               0
email                  0
phone                  0
website                0
address.street         0
address.suite          0
address.city           0
address.zipcode        0
address.geo.lat        0
address.geo.lng        0
company.name           0
company.catchPhrase    0
company.bs             0
dtype: int64

In [55]:
# Eliminar duplicados del API
df_api_clean = df_api.drop_duplicates()

In [56]:
# Eliminar valores nulos
df_api_clean = df_api_clean.dropna()

df_api_clean.shape

(10, 15)

# Transformación de Datos

In [57]:
# Aplicar transformaciones a los datos del API
df_api_clean['phone_format'] = df_api_clean['phone'].apply(
    lambda x: 'US_Format' if x.startswith('1-') or x.startswith('(') 
    else 'International' if x.startswith('0') 
    else 'Other'
)

df_api_clean['user_category'] = pd.cut(df_api_clean['id'], 
                                      bins=[0, 3, 7, float('inf')], 
                                      labels=['Nuevo', 'Intermedio', 'Avanzado'])

df_api_clean['first_name'] = df_api_clean['name'].str.split().str[0]
df_api_clean['last_name'] = df_api_clean['name'].str.split().str[-1]

df_api_clean.head()

,id,name,username,email,phone,website,address.street,address.suite,address.city,address.zipcode,address.geo.lat,address.geo.lng,company.name,company.catchPhrase,company.bs,phone_format,user_category,first_name,last_name
0,1,Leanne Graham,Bret,Sincere@april.biz,1-770-736-8031 x56442,hildegard.org,Kulas Light,Apt. 556,Gwenborough,92998-3874,-37.3159,81.1496,Romaguera-Crona,Multi-layered client-server neural-net,harness real-time e-markets,US_Format,Nuevo,Leanne,Graham
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,010-692-6593 x09125,anastasia.net,Victor Plains,Suite 879,Wisokyburgh,90566-7771,-43.9509,-34.4618,Deckow-Crist,Proactive didactic contingency,synergize scalable supply-chains,International,Nuevo,Ervin,Howell
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,1-463-123-4447,ramiro.info,Douglas Extension,Suite 847,McKenziehaven,59590-4157,-68.6102,-47.0653,Romaguera-Jacobson,Face to face bifurcated interface,e-enable strategic applications,US_Format,Nuevo,Clementine,Bauch
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,493-170-9623 x156,kale.biz,Hoeger Mall,Apt. 692,South Elvis,53919-4257,29.4572,-164.2990,Robel-Corkery,Multi-tiered zero tolerance productivity,transition cutting-edge web services,Other,Intermedio,Patricia,Lebsack
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,(254)954-1289,demarco.info,Skiles Walks,Suite 351,Roscoeview,33263,-31.8129,62.5342,Keebler LLC,User-centric fault-tolerant solution,revolutionize end-to-end systems,US_Format,Intermedio,Chelsey,Dietrich

# Exportar datos

In [30]:
import pandas as pd
import requests
from sqlalchemy import create_engine, text
import pymysql

# 1. Conectar a la base de datos MySQL (ajusta tus datos de conexión)
engine = create_engine('mysql+pymysql://root:1234@localhost:3309/employees_ai_db', echo=False)

# 2. Obtener datos desde una API pública (usuarios)
response = requests.get('https://jsonplaceholder.typicode.com/users')
if response.status_code == 200:
    df_api = pd.DataFrame(response.json())
else:
    raise Exception(f"Error al obtener datos: {response.status_code}")

# 3. Limpiar y transformar los datos
df_api_clean = df_api.copy()

# Asegurar que todas las columnas tipo dict se conviertan a string
for col in df_api_clean.columns:
    if df_api_clean[col].apply(lambda x: isinstance(x, dict)).any():
        df_api_clean[col] = df_api_clean[col].apply(str)

# Clasificar formato de teléfono
df_api_clean['phone_format'] = df_api_clean['phone'].apply(
    lambda x: 'US_Format' if str(x).startswith('1-') or str(x).startswith('(')
    else 'International' if str(x).startswith('0')
    else 'Other'
)

# Clasificar usuario según ID
df_api_clean['user_category'] = pd.cut(df_api_clean['id'],
                                       bins=[0, 3, 7, float('inf')],
                                       labels=['Nuevo', 'Intermedio', 'Avanzado'])

# Separar primer y último nombre
df_api_clean['first_name'] = df_api_clean['name'].str.split().str[0]
df_api_clean['last_name'] = df_api_clean['name'].str.split().str[-1]

# 4. Mapear tipos de datos de pandas a SQL
def map_dtype(dtype):
    if pd.api.types.is_integer_dtype(dtype):
        return "INT"
    elif pd.api.types.is_float_dtype(dtype):
        return "FLOAT"
    elif pd.api.types.is_datetime64_any_dtype(dtype):
        return "DATETIME"
    else:
        return "VARCHAR(255)"

# Generar definición de columnas SQL desde el DataFrame
column_defs = ",\n".join([
    f"`{col}` {map_dtype(dtype)}"
    for col, dtype in df_api_clean.dtypes.items()
])

# 5. Crear tabla temporal y cargar datos
with engine.connect() as conn:
    # Eliminar si ya existe (opcional por seguridad)
    conn.execute(text("DROP TEMPORARY TABLE IF EXISTS api_data_processed_temp;"))

    # Crear tabla temporal con columnas dinámicas
    create_table_sql = f"""
    CREATE TEMPORARY TABLE api_data_processed_temp (
        {column_defs}
    );
    """
    conn.execute(text(create_table_sql))

    # Insertar datos desde el DataFrame
    df_api_clean.to_sql('api_data_processed_temp', con=conn, if_exists='append', index=False)

    # Verificar inserción
    result = conn.execute(text("SELECT COUNT(*) FROM api_data_processed_temp"))
    count = result.scalar()
    print(f"✅ Se insertaron {count} registros en la tabla temporal.")

✅ Se insertaron 10 registros en la tabla temporal.